# Heroes of Pymoli
I have been assigned the task of analyzing the data for their most recent fantasy game Heroes of Pymoli.

Like many others in its genre, the game is free-to-play, but players are encouraged to purchase optional items that enhance their playing experience. As a first task, the company would like you to generate a report that breaks down the game's purchasing data into meaningful insights.

In [3]:
# Dependencies and Setup
import pandas as pd

# Reference to the file where the CSV is located and upload
purchase_path = "Resources/purchase_data.csv"

# Read Purchasing File and store into Pandas data frame
purchase_data = pd.read_csv(purchase_path, encoding="utf-8")
purchase_data.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

## Player Count

There are a total of 576 players with unique screen name who purchased Heroes Of Pymoli items. These players paid to play with this games.

In [4]:
# Calculate Total Number of Players
total_players = len(purchase_data["SN"].value_counts())

# Create a data frame with the total players
player_count = pd.DataFrame({"Total Players":[total_players]})
player_count

   Total Players
0            576

## Purchasing Analysis (Total)

There were 183 unique items for sale to the players of Heroes Of Pymoli. 
These items were purchased 780 times, leading to a total sales of $2,379.77. 
On average, the items bought were priced at $3.05.

In [56]:
# Running calculations to obtain total number of unique item, average price, total purchase count, and revenue.
total_unique_items = len(purchase_data['Item ID'].unique())
total_average_price = (purchase_data['Price']).mean()
total_items_purchase = (purchase_data['Purchase ID']).count()
total_revenue = (purchase_data['Price']).sum()

# Create a data frame to load the values
summary_purchases_df = pd.DataFrame({'Number of Unique Items': [total_unique_items],
                                  'Average Price': [total_average_price],
                                  'Items Purchase': [total_items_purchase],
                                  'Revenue': [total_revenue]
                                 })

#Format for currency in Average Price and Revenue
summary_purchases_df.style.format({'Average Price':"${:,.2f}",
                              'Revenue': '${:,.2f}'})

## Gender Demographics

In [57]:
# Calculate the number of players by gender with duplicates
gender_groups = purchase_data.groupby("Gender")
gender_count = gender_groups.size()
gender_count

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
dtype: int64

In [58]:
# Calculate the number of players by gender without duplicates
gender_players_groups = purchase_data.drop_duplicates("SN").groupby('Gender')
gender_count_drop = gender_players_groups.size()
gender_count_drop

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [60]:
# Calculate the number of players by gender in the group without duplicate
gender_players_count = gender_players_groups.size()
gender_players_count

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
dtype: int64

In [61]:
# Calculate the number of players based on unique SN
player_count = len(purchase_data["SN"].unique())
player_count

576

In [63]:
# Calculate the percentage of player by gender 
gender_players_percentage = (gender_players_groups.size() / player_count)
gender_players_percentage

Gender
Female                   0.140625
Male                     0.840278
Other / Non-Disclosed    0.019097
dtype: float64

In [65]:
# Create the data frame for gender counts and percentage
gender_demographics = pd.DataFrame({'Total Count':gender_players_count,
                                    'Percentage of Players': gender_players_percentage})

gender_demographics

                       Total Count  Percentage of Players
Gender
Female                          81               0.140625
Male                           484               0.840278
Other / Non-Disclosed           11               0.019097

In [66]:
# Format the data frame with no index name in the corner
gender_demographics.index.name = None

In [67]:
# Format the values sorted by total count in descending order, and two decimal places for the percentage
gender_demographics.sort_values(["Total Count"], ascending = False).style.format({"Percentage of Players":"{:.2%}"})


## Purchasing Analysis (Gender)

Men are more than three times as likely to make gaming purchases than women.
----Women are more motivated to buy shoes and bag----

In [84]:
#PURCHASING ANALYSIS (GENDER)

# Calculate the number of players and purchase by gender without to drop the duplicates
gender_df = purchase_data.groupby('Gender')

In [85]:
# Number of Purchase per gender using purchase Id
purchase_count = gender_df['Purchase ID'].count()

In [86]:
# Calculate Average number of Purchases by gender
avg_number_purchase = round((purchase_count / gender_count),2)

In [87]:
# Calculate the Total Purchase Value by gender
total_purchase_gender = gender_df['Price'].sum()

In [88]:
# calculate 
gender_groups = purchase_data.drop_duplicates("SN").groupby("Gender")
gender_count = gender_groups.size()
gender_count

# average total purchase price per person by gender
avg_purchase_person = round((total_purchase_gender / gender_count),2)

In [89]:
# average total purchase price by gender
avg_purchase_gender = round((total_purchase_gender / purchase_count),2)

In [90]:
# Building table with values
gender_analysis = pd.DataFrame(dict(purchase_count = purchase_count,
                                    avg_purchase_gender = avg_purchase_gender,
                                    total_purchase_gender = total_purchase_gender,
                                    avg_purchase_person = avg_purchase_person,
                                   ))

In [91]:
#Purchase Count Average Purchase Price Total Purchase Value Avg Total Purchase per Person
gender_analysis = gender_analysis.rename(columns = {"purchase_count": "Purchase Count",
                                                    "avg_purchase_gender": "Average Purchase Price",
                                                    "total_purchase_gender": "Total Purchase Value",
                                                    "avg_purchase_person": "Avg Total Purchase per Person",
                                                   })
 
gender_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Gender,,,,
Female,113,3.20,361.94,4.47
Male,652,3.02,1967.64,4.07
Other / Non-Disclosed,15,3.35,50.19,4.56

In [92]:
# Provide index in top left as "Gender"
gender_analysis.index.name = "Gender"

In [93]:
# Format columns Average Purchase Price, Total Purchase Value, and Avg Total Purchase per Person to currency $
gender_analysis.style.format({"Average Purchase Price":"${:,.2f}",
                              "Total Purchase Value":"${:,.2f}",
                             "Avg Total Purchase per Person":"${:,.2f}"
                             })

## Age Demographics

Observing the table of Results for Heroes pf Pymoli: 
The first tier of players belong to the 20 to 24 year of age with top percent of 44.79% which correspond to 258 players. The second tier belong to the 15-19 year of age with 18.58%.
Presumaly,  The first tier has higher income than youngest tiers. 
The tiers 25+ have higher income but they have other entertainment and priorities in their lifes.

In [135]:
# AGE DEMOGRAPHICS

# Define the bins for the age ranges
bins = [0, 10, 15, 20, 25, 30, 35, 40, 45]

# define the groups by range age
group_range_names = ["<10", "10–14", "15–19","20–24", "25–29", "30–34", "35–39","40+"]

In [136]:
# Include a column in the data frame for the group_ranges_names
purchase_data['Age Ranges'] = pd.cut(purchase_data["Age"], bins, right = False, labels=group_range_names)

In [137]:
# Calculate the numer of players allocate to each bin
age_range = purchase_data.drop_duplicates("SN").groupby("Age Ranges")

In [138]:
# Calculate the number of players allocate per age into the range
size_age_group = age_range["Age"].count()

In [139]:
# Calculate the percentage of players per bin
age_groups = (size_age_group / player_count)
age_groups

Age Ranges
<10      0.029514
10–14    0.038194
15–19    0.185764
20–24    0.447917
25–29    0.133681
30–34    0.090278
35–39    0.053819
40+      0.019097
Name: Age, dtype: float64

In [140]:
# Bring the data and build a table summary
age_groups_table = pd.DataFrame(dict(size_age_group = size_age_group, 
                                     age_groups = age_groups
                                    ))

In [141]:
# Rename the columns of the Sumary Table to Number of Playes and Proportion (%)
age_groups_table = age_groups_table.rename(columns = {"size_age_group": "Number of Playes", 
                                     "age_groups": "Proportion (%)"})
age_groups_table

            Number of Playes  Proportion (%)
Age Ranges
<10                       17        0.029514
10–14                     22        0.038194
15–19                    107        0.185764
20–24                    258        0.447917
25–29                     77        0.133681
30–34                     52        0.090278
35–39                     31        0.053819
40+                       11        0.019097

In [142]:
# Format the values of Proportion to percentage with %
age_groups_table.style.format({"Proportion (%)":"{:.2%}"})

## Purchasing Analysis (Age)

Purchasing Analysis by age
The majority of the items purchase (47%) are from the group 20-24 years of age. They are the top contibutor to the revenue The second group are 15 -19 years of age and they contribute with 17%. These two groups represent 64% of the purchase of the games. The average cost for these group is aprox. $3.05 which is slighly lower than the average price of $3.11

The third group are the age ranges 25-29, which contribute with 13% of the purchases, this group purchase almost four times less than the first group (78% vs 12%)

The rest of the groups are less than 9% of the purchase, they don't have a significant impact to the purchase therefore to the revenue.

In conclusion, the Heroes of Pymoli's games are more attractive the audience with age between 15 to 25. The percentage of players who spend money in games decrease with the age

In [143]:
# PURCHASE ANALYSIS (AGE)
# Basic calculations to obtain purchase count, avg purchase price, avg purchase total per person, etc
# The Group Purchase by Age 
purchase_age = purchase_data.groupby('Age Ranges')

In [144]:
# The total number of purchase by age
purchase_age_count = purchase_age["Purchase ID"].count()

In [145]:
# The average number of purchase by age
purchase_age_avg =round((purchase_age_count / size_age_group),2)

In [146]:
# The total price by age group
total_purchase_age = purchase_age['Price'].sum()

In [147]:
# The average price by age group
price_age_avg = round((total_purchase_age / purchase_age_count),2)

In [148]:
# The average price per person by ager group
price_person_age_avg = round((total_purchase_age / size_age_group ),2)

In [149]:
# build the summary table and display it
purchases_analysis = pd.DataFrame(dict(purchase_age_count = purchase_age_count,
                                        price_age_avg = price_age_avg,
                                        total_purchase_age = total_purchase_age,                                
                                         price_person_age_avg = price_person_age_avg                                
                                ))
purchases_analysis

,purchase_age_count,price_age_avg,total_purchase_age,price_person_age_avg
Age Ranges,,,,
<10,23,3.35,77.13,4.54
10–14,28,2.96,82.78,3.76
15–19,136,3.04,412.89,3.86
20–24,365,3.05,1114.06,4.32
25–29,101,2.90,293.00,3.81
30–34,73,2.93,214.00,4.12
35–39,41,3.60,147.67,4.76
40+,12,3.04,36.54,3.32

In [150]:
# Add title to the summary table
purchases_analysis = purchases_analysis.rename(columns = {"purchase_age_count": "Purchase Count",
                                                          "price_age_avg": "Average Purchase Price",
                                                          "total_purchase_age": "Total Purchase Value",
                                                          "price_person_age_avg": "Avg Total Purchase per Person"
                                                         })
purchases_analysis

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,3.35,77.13,4.54
10–14,28,2.96,82.78,3.76
15–19,136,3.04,412.89,3.86
20–24,365,3.05,1114.06,4.32
25–29,101,2.90,293.00,3.81
30–34,73,2.93,214.00,4.12
35–39,41,3.60,147.67,4.76
40+,12,3.04,36.54,3.32

In [151]:
# Format columns Average Purchase Price, Total Purchase Value, and Avg Total Purchase per Person to currency $
purchases_analysis.style.format({"Average Purchase Price":"${:,.2f}",
                              "Total Purchase Value":"${:,.2f}",
                             "Avg Total Purchase per Person":"${:,.2f}"
                             })

## Top Spenders

The high buyer on the group is the player with the SN Lisosia93, with number of item of 5, average purchase price of $3.79 and total purchase value of $18.96
The top five (5) players on the purchase of Heroes of Pymoli represent 3% of the total purchase value.

In [170]:
# TOP SPENDERS
# Define a group of player by SN
high_expender = purchase_data.groupby("SN")

In [171]:
# Estimate the purchase cost for each player
purchase_SN_total = high_expender["Price"].sum()

In [172]:
# Calculate number of purchase for each player
purchase_SN_quantity =  high_expender["Purchase ID"].count()

In [173]:
# Calculate the average purchase cost for each player
purchase_SN_avg = high_expender["Price"].mean()

In [176]:
# Build a data frame to include both values: purchase cost for each player and number of purchase for each player
high_expender_player = pd.DataFrame({"Purchase Count":purchase_SN_quantity,
                                    "Average Purchase Price": purchase_SN_avg,
                                    "Total Purchase Value": purchase_SN_total})
high_expender_player

               Purchase Count  Average Purchase Price  Total Purchase Value
SN
Adairialis76                1                2.280000                  2.28
Adastirin33                 1                4.480000                  4.48
Aeda94                      1                4.910000                  4.91
Aela59                      1                4.320000                  4.32
Aelaria33                   1                1.790000                  1.79
...                       ...                     ...                   ...
Yathecal82                  3                2.073333                  6.22
Yathedeu43                  2                3.010000                  6.02
Yoishirrala98               1                4.580000                  4.58
Zhisrisu83                  2                3.945000                  7.89
Zontibe81                   3                2.676667                  8.03

[576 rows x 3 columns]

In [178]:
# Sort in descending order to obtain top 5 spender names 
expender_analysis = high_expender_player.sort_values(["Total Purchase Value"], ascending=False).head()
expender_analysis

             Purchase Count  Average Purchase Price  Total Purchase Value
SN
Lisosia93                 5                3.792000                 18.96
Idastidru52               4                3.862500                 15.45
Chamjask73                3                4.610000                 13.83
Iral74                    4                3.405000                 13.62
Iskadarya95               3                4.366667                 13.10

In [179]:
# Format columns Average Purchase Price, Total Purchase Value to currency $
expender_analysis.style.format({"Average Purchase Price":"${:,.2f}",
                              "Total Purchase Value":"${:,.2f}",
                             })

## Most Popular Items

The item most popular to the players is "Oathbreaker, Last Hope of the Breaking Storm". The players bought in 12 items at the average price of $4.23 to achieved a total product value of $50.76.

The next three items most popular are "Fiery Glass Crusader","Extraction, Quickblade Of Trembling Hands" and Nirvana, they share similar quantity of purchase of 9 items.

    The fifth item, "Pursuit, cudgel of necromancy" is popular to the players and have the lower cost of $1.02. Look very surprise!!! The players adquire this item were male on the range of age 20 to 30.

The most popular items shown highest prices on the Heroes of Pymoli games.

In [187]:
# MOST POPULAR ITEMS
# In order to identify the popular items, i will create a table with Item ID, Item Name in the index and 3 columns
# with the data value for Purchase Count, Item Price and Total Purchase Value

# Create a data frame
popular_items = purchase_data[["Item ID", "Item Name","Price"]]

In [188]:
# Create group of items based on Item ID, Item Name 
popular_items_group = popular_items.groupby(["Item ID", "Item Name"])

In [189]:
# calculate the purchase cost per item
popular_items_total = popular_items_group["Price"].sum()

In [191]:
# calculate number of purchase per item
popular_items_quantity =  popular_items_group["Item ID"].count()

In [195]:
# Calculate the average price per item
popular_items_avg = popular_items_group["Price"].mean()

In [196]:
#Create a data frame to hold the values
popular_items_analysis = pd.DataFrame({"Purchase Count": popular_items_quantity, 
                                   "Item Price": popular_items_avg,
                                   "Total Purchase Value":popular_items_total})

popular_items_analysis

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
0,Splinter,4,1.28,5.12
1,Crucifer,3,3.26,9.78
2,Verdict,6,2.48,14.88
3,Phantomlight,6,2.49,14.94
4,Bloodlord's Fetish,5,1.70,8.50
...,...,...,...,...
179,"Wolf, Promise of the Moonwalker",6,4.48,26.88
180,Stormcaller,1,3.36,3.36
181,Reaper's Toll,5,1.66,8.30
182,Toothpick,3,4.03,12.09
183,Dragon's Greatsword,3,1.09,3.27

In [197]:
# Sort in descending order to obtain top spender names and provide top 5 item names
popular_analysis_formatted = popular_items_analysis.sort_values(["Purchase Count"], ascending=False).head()

In [198]:
# Format with currency style
popular_analysis_formatted.style.format({"Item Price":"${:,.2f}",
                                "Total Purchase Value":"${:,.2f}"})

## Most Profitable Items

In [201]:
# MOST PROFITABLE ITEMS
# Sort popular_analysis by Total Purchase Value in descending order
popular_analysis_formatted = popular_items_analysis.sort_values(["Total Purchase Value"], ascending=False).head()
popular_analysis_formatted

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
178,"Oathbreaker, Last Hope of the Breaking Storm",12,4.23,50.76
82,Nirvana,9,4.90,44.10
145,Fiery Glass Crusader,9,4.58,41.22
92,Final Critic,8,4.88,39.04
103,Singed Scalpel,8,4.35,34.80

# References:
https://pandas.pydata.org/pandas-docs/stable/reference/io.html

https://pandas.pydata.org/pandas-docs/version/0.8.1/generated/pandas.DataFrame.align.html

Eric Matheus, Python Crash Course. URL: https://ehmatthes.github.io/pcc/

The Demographics of Video Gaming by Carolyn Pairitz Morris. URL: https://www.earnest.com/blog/the-demographics-of-video-gaming/

google seach is a wonderfull source of information. URL: https://www.google.com/